app/views/users/show.html.erb

      <% else %>
          <% @current_user = User.find_by(:id => session["user_id"]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 23]]

        <label>Posts: </label>
        <%= @user.posts.count %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 22]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 22]]