app/views/posts/index.html.erb

						<%= link_to post.title, post_url(post.id),  :method => 'get'%>
						<h6><%= link_to User.where(:id=>post.user_id).pluck("user_name")[0], user_url(post.user_id),
                                                                                 :class=>"blackColor" %></h6>
---
SELECT "users"."user_name" FROM "users" WHERE "users"."id" = ?  [["id", 16]]