app/views/posts/show.html.erb

					<h3 class="panel-title"><%= link_to @post.title, post_url(@post.id),  :method => 'get' %></h3>
                    <h6><%= link_to User.find_by(:id => @post.user_id).user_name, user_url(@post.user_id) %></h6>
---
SELECT "users"."user_name" FROM "users" WHERE "users"."id" = ?  [["id", 14]]

            <ul>
                <label>Categories:</label><% @post.categories.pluck(:category_name).each do |category| %>
---
SELECT "categories"."category_name" FROM "categories" INNER JOIN "mappings" ON "categories"."id" = "mappings"."category_id" WHERE "mappings"."post_id" = ?  [["post_id", 5]]

                  <%= form_tag "/mappings", :method => 'post' do %>
                      <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"

      <ul class="list-group">
        <% @comments = Comment.where(post_id: @post.id).limit(100).order('date desc').page(params[:page]).per(5) %>
---
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."post_id" = ?  ORDER BY date desc, date LIMIT 5 OFFSET 0  [["post_id", 26], ["post_id", 26]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 26]]