app/controllers/comments_controller.rb

def create
    c = Comment.new
    #logger.debug "****#{params["user_id"]}"
    c.user_id = params["user_id"]
  #  logger.debug "****#{c.user_id}"
    c.post_id = params["post_id"]
    c.date = Time.now
    c.body = params["body"]
    c.save
---
INSERT INTO "comments" ("user_id", "post_id", "date", "body") VALUES (?, ?, ?, ?)  [["user_id", 16], ["post_id", 7], ["date", "2015-05-21 23:33:49.526311"], ["body", "hahah"]]