app/controllers/mappings_controller.rb

def create

	array = params["category_ids"]

	array.each{|category_id|
	m = Mapping.new
    m.category_id = category_id
    m.post_id = params["post_id"]
    m.save
---
INSERT INTO "mappings" ("category_id", "post_id") VALUES (?, ?)  [["category_id", 108], ["post_id", 13]]