app/controllers/posts_controller.rb

 def find_post
 	@post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 13]]

 def index
	#@posts = Post.all.limit(1000).offset(1000)
	@posts = Post.all.limit(1000).order('date desc').page(params[:page]).per(10)
---
SELECT  "posts".* FROM "posts"  ORDER BY date desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "posts"

 def create
 	@post = Post.new
	@post.user_id = session["user_id"]
	@post.title = params[:title]
	@post.date = Time.now
	@post.body = params[:body]

	if @post.save
---
INSERT INTO "posts" ("user_id", "title", "date", "body") VALUES (?, ?, ?, ?)  [["user_id", 16], ["title", "test "], ["date", "2015-05-21 23:24:36.189048"], ["body", "testtest"]]

 def update

	@post.user_id = session["user_id"]
	@post.title = params[:title]
	@post.date = params[:date]
	@post.body = params[:body]
	@post.save
---
UPDATE "posts" SET "user_id" = ?, "date" = ?, "body" = ? WHERE "posts"."id" = ?  [["user_id", nil], ["date", "2015-05-30 23:17:29.000000"], ["body", "<p><p>this is a test</p></p>"], ["id", 18]]

 def destroy
    @post.delete
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 5]]