app/controllers/relations_controller.rb

  def destroy
    @user = Relation.find(params[:id]).followed
---
SELECT  "relations".* FROM "relations" WHERE "relations"."id" = ? LIMIT 1  [["id", 9]]