app/controllers/users_controller.rb

  def find_user
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 23]]

  def create
  #@user = User.new(params) #mass assignment is a bad practice in terms of security
  	#file_contents = params[:photo].read

    @user = User.new(user_name: params[:name], email: params[:email], password: params[:password])
    if @user.save
---
INSERT INTO "users" ("user_name", "email", "password_digest") VALUES (?, ?, ?)  [["user_name", "JOCELYN ZHANG"], ["email", "me@wordpress.com"], ["password_digest", "$2a$10$DAvetEaNSI37PPI6.P/fBOYXZz13aAnlsy1odROKC44Lga51YOUPG"]]

  def posts
    @posts = @user.posts.order('date desc').page(params[:page]).per(10)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ?  ORDER BY date desc LIMIT 10 OFFSET 0  [["user_id", 23]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 23]]

  def friends_posts
    @users = @user.followings
    @posts = Post.where(:user_id => @users.pluck("id")).order('date desc').page(params[:page]).per(10)
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 22]]